#include <stdio.h>
main()
{
    int a[101];
    int i, j;
    for (i = 2; i < 101; ++i)
        a[i] = i; // 2 to 100
    for (i = 2; i < 101; ++i)
    {
        if (a[i] != 0)
        {
            for (j = i * 2; j < 101; j += i)
            {
                // i=2: 4 6 8 10 ...
                // i=3: 6 9 12 15 ...
                // i=4: 8 12 16 ...
                // i=5: 10 15 20 ...
                // 2 3 4 5 ... 以及其倍数均为非质数
                // 将以上数字标记为 0
                a[j] = 0;
            }
        }
    }
    for (i = 2; i < 101; ++i)
    {
        if (a[i] != 0)
            // 遍历a列表，若a[i]不为0，则说明i为质数
            printf("%d\n", a[i]);
    }
}